  //::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\\
//::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\\
/*                                     ===План по созданию Discord бота===
                                  Создание и оформление робочей среды и команд.
===Установить условие удаление сообщений пользователя с вызовом команды при реагировании и выполнении самой команды.===
                                        Оформление основной среды комманд:
 Разбить комманды на типы: info; music; moderator; levels; fun; function; reaction. =>

 info:                 music:               moderator:           levels:               fun:
help                  join                 ban                  leaderboar            bye
info                  leave                unban                rank                  hello
role                  loop                 mute                                       honour
roleinfo              next                 unmute                                     sey
server                pause                clear
user                  play                 kick
                      stop                 prefix
                                           test
                                           warn

                                        <=====ОФОРМЛЕНИЕ INDEX.JS=====>
                    При в ходе на новый сервер происходит создание голосового канала ботом:
                                      ===================================
                                       #scheune_flutternyash ||
                                       #scheune
                                      ===================================
 В данном канале будет осуществлятся управление ботом или подальшее удаление канала администратором. Следующим после
создания канала бот кинет туда первую реплику "привествие", после чего станет полностью готовым к использованию.
При добавлении учасника на сервер или его ливе будет сопроваждатся сообщением в его или системный текстовый канал
(если тот имеется) после оформления и верстки сайта будет полное управление ботом и командами извне, возможность
добавления бот.лога сервера для мониторинга действий администраторам и модираторам.

Сообщение "привествие":
     ===============================================================================
     О, дарова мудилы. А я на долго сюда? Просто у меня там молоко убегает...
     ===============================================================================

Сообщение при новом пользователе на сервере:
     ===============================================================================
     Хей-гей-ге-ей, ~~${member}~~ мудила, ты еще пожалеешь что припёрся в мой сарай!
     ===============================================================================

Сообщение при ливе пользователя из сервера:
     ===============================================================================
     Что я говорил по поводу моего сарая, ~~${member}~~ сученыш?
     ===============================================================================

Бот должен создавать файл кеша для каждого сервека на который его приглашают и которому производят настройки бота.
Функция бота о ежедневном оповещание о своих функциях и командах.

::::::::::::::::::::::::::::::::::::::::::::::::::::::info::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                                    help, info, server, user, role, roleinfo...

------------------------------------------------------------------------------------------------------------------------
                                                      =help=
------------------------------------------------------------------------------------------------------------------------

 Описание: Общая информация по доступным командам.
 Примеры оформления: [command{text}]
 Значение кнопок: В начало листа - [<<] Назад - [<] Закрыть - [[]] Вперед - [>] В конец листа - [>>]

  1. Использование емоций для перелистования с приминением разметки.

     |========================================================================
     | [A] NickName                                                  [GIF]
     |
     |
     |                       == Помощь даунам ==
     |                       = Музыкальный бот =
     | []play - присоеденяется к какналу и включает трек если тот был указан.
     | []stop - остонавливает музыку но остается в голосовом канале.
     | []next - запускает следующий трек в очереди если таков есть.
     | []server - информация по серверу Discord.
     |
     | []Page{1/4}
     |========================================================================
      [<<] [<] [[]] [>] [>>]

  2. Использование разбивку по группам командами help 1, help 2...

     |========================================================================
     |                        = Помощь даунам =
     | []help 1/help info - команды по информативной части.
     | []help 2/help music - команды по части музыкального бота.
     | []help 3/help moderator - команды админ и модераторной части.
     |========================================================================

                              help 1/help info =>

     |========================================================================
     |                        = Общая информация =
     | []info - информация по боту.
     | []server - полная информация по данному серверу.
     | []role - количевство и список ролей на сервере.
     |========================================================================

  3. Использование разбивки по группам c разметкой:

     |========================================================================
     |                        = Помощь даунам =
     |    = Общая информация =
     | []info - информация по боту.
     | []server - полная информация по данному серверу.
     | []role - количевство и список ролей на сервере.
     |
     |     = Музыкальный бот =
     | []play - присоеденяется к какналу и включает трек если тот был указан.
     | []stop - остонавливает музыку но остается в голосовом канале.
     | []next - запускает следующий трек в очереди если таков есть.
     |========================================================================

 Примечание: Комманда help не должна присуствовать в списке команд при ее вызове.

------------------------------------------------------------------------------------------------------------------------
                                                    =info=
------------------------------------------------------------------------------------------------------------------------

 Описание: Предоставление общей информации бота.
 Полное описание строк и оформление: Название бота и лого[name][img], пользователи[user:{kol}],
                     создатели[nameID:{text}], время безпрерывной работы бота[upTime:{time}],
                     версия бота[version:{number}], ссылка на сайт бота[website],
                     прямая ссылка приглашение[invite:{links}], дата релиза бота[release:{date}].

 Пример оформления:
     |========================================================================
     |    !Название бота!                                    !Лого!
     |
     | Пользователи:               ВебСайт:                  Инвайт:
     |    3968547                  bot.com               bot.com.invite
     |
     |  Серверов:
     |    34920
     |
     |Создатели:
     |[]Flutt|ernyash#9235
     |[]Артси#7095
     |
     | Times: 32ч 56м 3с| Version: 1.0.0| Release: 15.Mart.2020
     |========================================================================

 Примечание: Нужны правки и уточнения.

------------------------------------------------------------------------------------------------------------------------
                                                     =server=
------------------------------------------------------------------------------------------------------------------------

 Описание: Описание данного сервера и информация.
 Полное описание строк и оформление: Название сервера и лого[name][img],
   Пользователи:(user:         Статус:(status:              Каналы:(channel:
   [total{kol}];               [online{kol}];               [total{kol}];
   [members{kol}];             [idle{kol}];                 [text{kol}];
   [bot{kol}];                 [dnd{kol};                   [voice{kol};
 );                            [offline{kol}];             );
                              );

 Создатель:[nameID{text}], Регион:[region{state}], Верификация серва[Verification level:{level}]
 Дата создания сервера:[created at:{date, time}], Айди сервера:[ID{number}].

 Пример офоримления:
     |========================================================================
     |    !Название сервера!                                    !Лого!
     |
     | Юзер:                 Статус:                  Каналы:
     | []Общее: 100          []Онлайн: 35             []Общее: 33
     | []Люди: 95            []Не активен: 10         []Текстовые: 20
     | []Бот: 5              []Не беспокоить: 5       []Голосовые: 13
     |                       []Оффлайн: 50
     |
     |Создатель:             Region:                  Verification Level:
     |[]Flutt|ernyash#9235   []Europe                 High
     |
     |Created at: Oct 2, 2018, 2:29:58 PM| ID: 496645015410442270
     |========================================================================

 Примечание: Возможно дополнение и поправки.

------------------------------------------------------------------------------------------------------------------------
                                                       =user=
------------------------------------------------------------------------------------------------------------------------

 Описание: Описание выбраного персонажа и информация.
 Полное описание строк и оформление: Название сервера и лого[name][img],
   Пользователи:(user:         Статус:(status:              Каналы:(channel:
   [total{kol}];               [online{kol}];               [total{kol}];
   [members{kol}];             [idle{kol}];                 [text{kol}];
   [bot{kol}];                 [dnd{kol};                   [voice{kol};
 );                            [offline{kol}];             );
                              );

 Создатель:[nameID{text}], Регион:[region{state}], верификация серва[Verification level:{level}]
 дата создания сервера:[created at:{date, time}], айди сервера:[ID{number}].

 Пример офоримления:
     |========================================================================
     |    !Название сервера!                                    !Лого!
     |
     | Юзер:                 Статус:                  Каналы:
     | []Общее: 100          []Онлайн: 35             []Общее: 33
     | []Люди: 95            []Не активен: 10         []Текстовые: 20
     | []Бот: 5              []Не беспокоить: 5       []Голосовые: 13
     |                       []Оффлайн: 50
     |
     |Создатель:             Region:                  Verification Level:
     |[]Flutt|ernyash#9235   []Europe                 High
     |
     |Created at: Oct 2, 2018, 2:29:58 PM| ID: 496645015410442270
     |========================================================================

 Примечание: Возможно дополнение и поправки.

------------------------------------------------------------------------------------------------------------------------
                                                     =role=
------------------------------------------------------------------------------------------------------------------------

 Описание: Информация о количестве ролей на сервере и их список.
 Пример оформления: Все роли [titleRole:{kol}]; таблица ролей.

     |========================================================================
     |  Title Role[kol] {
     |  @role 1
     |  @role 2
     |  @role 3
     |  @role 4...
     | }
     |========================================================================
 Примечание: Возможно использование число общего колличевства ролей на сервере в конце списка.

------------------------------------------------------------------------------------------------------------------------
                                                    =roleinfo=
------------------------------------------------------------------------------------------------------------------------

 Описание: Информация о выбранной роли на сервере.
 Использование: roleinfo[nameRole].
 Пример оформления: Инфо по указаной роли [infoInRole:{Role}], Айди роли [ID:{number}],
           Айди цвета роли [color:{colorID}], позиция роли в ролЛист [position{number}],
           Возможность упоминание роли [mentionable:{yes/no}], роль в отдельном списке [hoisted{yes/no}],
           Разрешения роли [permissions:{permissionsList}], Дата создания роли [role created:{date}].

     |========================================================================
     | Info in Role [WoW]
     | ID: [732732578930360411]
     | Color: [#f1c40f]
     | Position: [11]
     | Mentionable: [Yes]
     | Hoisted: [Yes]
     | Permissions:
     | Manage Emojis
     | Mention Everyone
     |
     | Role Created: •15.07.2020
     |========================================================================
 Примечание: Возможно правки в оформлении.

::::::::::::::::::::::::::::::::::::::::::::::::::::::music:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                                play, stop, next, back, loop, pause, join, leave...

------------------------------------------------------------------------------------------------------------------------
                                                      =play=
------------------------------------------------------------------------------------------------------------------------
 Описание: Управление музыкальной частью бота. Офформление, внешний инетерфейс, система очереди.
 Использование: play[nameTrack || url || urlPlayList]
 Пример оформления: Изображдение маленькой GIF[G] [urlGIF], изображение альбомного листа [lists],
описание происходящего: [Сейчас играет:], название трека: [nameTrack],  основная(нижняя) информация: [ago,time,author].
Значение кнопок: Back - [<] loop - [69] pause - [||] stop - [[]] next - [>]

 Проигрование по названию или прямой ссылке:
     |==================================================================================
     | [G] Сейчас играет:                                          |         |
     |                                                             | [lists] |
     | КОРОЛЬ И ШУТ ЛУЧШИЕ ПЕСНИ ТОП 50                            |         |
     |
     | Был залит на YouTube: 1 год назад. Продожительность: 2:53:11. Запросил: ник#7654
     |==================================================================================
     [<] [69] [||] [[]] [>]

 Проигрование по ссылке на плейлист:
 Пример оформления: какая песня по счету играет: [play/full], название плейлиста [namePlaylist],
общее количевство треков: [fullCollTrackPlaylist].
     |==================================================================================
     | [G] {Название плейлиста} 3/66                               |         |
     | Сейчас играет:                                              | [lists] |
     | КОРОЛЬ И ШУТ ЛУЧШИЕ ПЕСНИ ТОП                               |         |
     |
     | Общее количевство треков: 66. Запросил: ник#7654
     |==================================================================================
     [<] [69] [||] [[]] [>]

 Оформление добавления трека в список очереди.
 Пример оформления: Название добавленного в список трека: {name[nameTrack]}.
     |==================================================================================
     | [G]  В список добавлен:                                     |         |
     |                                                             | [lists] |
     | КОРОЛЬ И ШУТ ЛУЧШИЕ ПЕСНИ ТОП                               |         |
     |
     |
     | Был залит на YouTube: 1 год назад. Продожительность: 2:53:11. Запросил: ник#7654
     |==================================================================================

:::::::::::::::::::::::::::::::::::::::::::::::::::::moderator::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                      ban, unban, kick, mute, unmute, clear, warn, clearwarn, test, prefix..

------------------------------------------------------------------------------------------------------------------------
                                                       =ban=
Описание: Создание/обновление черного списка сервера с последующим добавлением туда пользователя с указаной причиной,
при возможности оформления добавить доп вопрос о удалении последних смс забаненного пользователя (1, 3, 7 суток).


------------------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------
                                                      =unban=
------------------------------------------------------------------------------------------------------------------------
При запросе разбана будет придоставен список забаненных на сервере с нумерезацией и ожиданием ответа с выбором цифры.
Оформить реакцию по ролям для постраничного использования, снести лимит списка.
------------------------------------------------------------------------------------------------------------------------
                                                       =kick=
------------------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------
                                                       =mute=
------------------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------
                                                      =unmute=
------------------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------
                                                       =clear=
------------------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------
                                                       =warn=
------------------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------
                                                     =clearwarn=
------------------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------
                                                      =prefix=
------------------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------
                                                       =test=
------------------------------------------------------------------------------------------------------------------------

 Описание: Проверка бота на работоспособность и отклик.
 Полное описание команды и оформление: При работоспособности бота будет отправлен рандом ответ-уведомление и
рандом гиф при проке [text{GIF}].
 Пример оформления:
     =========================================================================
     [name.members] Да да, черт возьми, я работаю.
     {Gif}
      ___________________________________________
     |                                            |
     |                                            |
     |                                            |
     |                 You GIF                    |
     |                                            |
     |                                            |
     |                                            |
     |____________________________________________|

     =========================================================================


:::::::::::::::::::::::::::::::::::::::::::::::::::::::levels:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                                                   levels, rank...





:::::::::::::::::::::::::::::::::::::::::::::::::::::::::fun::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                                         flirt, honour, sey, hello, bye,




:::::::::::::::::::::::::::::::::::::::::::::::::::::::function:::::::::::::::::::::::::::::::::::::::::::::::::::::::::




:::::::::::::::::::::::::::::::::::::::::::::::::::::::reaction:::::::::::::::::::::::::::::::::::::::::::::::::::::::::























Сделать уведомление от бота по новому видосу с нужного канала ютуб.

ОФОРМИТЬ КОМАНДУ ПРИ ОСКОРБЛЕНИИ ОБТВЕТ.
